---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetProperty
source: html/1fd72e8b-8f18-f157-e7db-b5362bfa9da0.htm
---
# AssetProperty Methods

Adds a new connected asset attached to this asset property, if it allows it.